{
	"publisher_id": 0,
	"publisher_package_id": 3289,
	"title": "ex2D",
	"description": "<p>\nex2D is a highly integrated 2D-sprite-related development extension for Unity. It aims at providing high performance 2D sprite/UI solution inside Unity, with a specific focus on creating tons of cutting-edge sprite animations and other content in complicated Unity scenes, while still maintaining great performance on mobile devices.\n</p>\n<br></br>\n<strong>Important: </strong><a href=\"http://www.ex-dev.com/ex2d/wiki/doku.php?id=manual:install#upgrade_from_v110_to_v111\">Upgrade from v1.1.0 to v1.1.1</a>\n<p><strong>Links:</strong></p>\n>    <a href=\"http://www.ex-dev.com/ex2d\">ex2D Website</a>\n | <a href=\"http://www.ex-dev.com/ex2d/wiki\">Online Documentation</a>\n | <a href=\"http://www.ex-dev.com/ex2d/wiki/doku.php?id=misc:change_log\">Change List</a>\n | <a href=\"http://forum.unity3d.com/threads/101811-ex2D-the-best-2D-sprite-solution-for-Unity-RELEASED\">Forum Thread</a>\n</p>\n\n<p><strong>Downloads:</strong></p>\n<p>\n> <a href=\"http://www.ex-dev.com/downloads/ex2d_doc.zip\">Offline Documentation</a>\n |  <a href=\"http://www.ex-dev.com/downloads/ex2d_script_ref.zip\">Offline Script Reference</a>\n</p>\n",
	"changes": "* New Features\n  * Add offset in exPlane, user can use offset adjust the anchor of exSprite and exSpriteFont\n  * When raw-texture changes (by Image Editor such as PhotoShop), ex2D will detect and rebuild the atlas to fit the new texture\n  * Sample Rate for Sprite Animation Clip\n  * Add buildColor in exAtlasInfo, user now can custom the background color of atlas texture\n* Changes\n  * Remove renderCamera property from exPixelPerfect, exViewportPosition and exScreenPostion. Instead, add renderCamera in exPlane\n  * Add toolbar for atlas and sprite animation clip editor, move some button to toolbar\n  * Frame based sprite animation editor, event and frame info are now snap to frame, and depends on Sample Rate\n* Bugs Fixed\n  * Fix MeshCollider not changes when autoResizeCollision is true\n  * Fix Prefab can not change Layer2D, PixelPerfect, Transform2D, Physics Collider settings\n  * Fix Animation Helpers can't preview the result in the animating mode in Animation View\n  * Fix Sprite Animation NOT play first frame\n  * Fix Sprite Animation NOT trigger event in first frame\n",
	"version_name": "1.1.2",
	"category": 102,
	"price": "25",
	"recommended_features": [],
	"required_features": []
}
