{
	"publisher_id": 0,
	"publisher_package_id": 3289,
	"title": "ex2D",
	"description": "<p>\nex2D is a highly integrated 2D-sprite-related development extension for Unity. It aims at providing high performance 2D sprite/UI solution inside Unity, with a specific focus on creating tons of cutting-edge sprite animations and other content in complicated Unity scenes, while still maintaining great performance on mobile devices.\n</p>\n<br></br>\n<p><strong>Links:</strong></p>\n>    <a href=\"http://www.ex-dev.com/ex2d\">ex2D Website</a>\n | <a href=\"http://www.ex-dev.com/ex2d/wiki\">Online Documentation</a>\n | <a href=\"http://www.ex-dev.com/ex2d/wiki/doku.php?id=misc:change_log\">Change List</a>\n | <a href=\"http://forum.unity3d.com/threads/101811-ex2D-the-best-2D-sprite-solution-for-Unity-RELEASED\">Forum Thread</a>\n</p>\n\n<p><strong>Important:</strong>As the production become stable, we are going to increase the price to $35 in next month.</p>\n\n<p><strong>Downloads:</strong></p>\n<p>\n> <a href=\"http://www.ex-dev.com/downloads/ex2d_doc.zip\">Offline Documentation</a>\n |  <a href=\"http://www.ex-dev.com/downloads/ex2d_script_ref.zip\">Offline Script Reference</a>\n</p>\n",
	"changes": "* New Feature\n  * Add “Normalize Scene Sprite Scales” which will change transform.scale to sprite.scale. (Normalize Sprite Scales)\n  * Add exDebugHelper for showing log, screen print and fps\n  * Add exPixelPerfectCamera let user customize resolution for pixel perfect calculation. (Render In Pixel Perfect)\n  * Drag scalable soft-clip rectangle\n\n* Changes\n  * When raw-texture trimmed size changes, the atlas will layout again.\n  * Add “Select Atlas” in Project Window menu, this help user easy jump to atlas from texture.\n  * Add ”-” button in the Animation field in animation sprite component, this help user easily remove animation clip from sprite animation.\n  * Add exSpriteAnimation.Play() function, it will play default animation.\n  * Add exSpriteAnimation.GetCurrentAnimation() function, it will return the current playing animation state.\n  * Add Undo to Atlas Editor for Move, Remove and Layout elements.\n\n* Bug Fixes\n  * Fix prefab will not update atlas when rebuilding.\n  * Fix sprite animation trigger event destroy self will cause null reference.\n  * Fix Layout in Atlas Editor will change same results.\n  * Fix exScreenPosition and exViewportPosition calculate wrong when camera is perspective.\n  * Fix sprite will not update if you change a texture with the same name but different extension.\n  * Fix PingPong animation trigger event wrong.\n  * Fix animation sometimes not trigger when looping.\n  * Fix animation event not trigger the first frame when changing animation.\n  * Fix animation clip editor preview play animation shakes.\n",
	"version_name": "1.2.1",
	"category": 102,
	"price": "25",
	"recommended_features": [],
	"required_features": []
}
